{
   "Above command convert all matched words from lower-case to upper-case. Actually this example itself is not so useful because B<greple> can do the same thing more effectively with B<--cm> option.\n" : "Приведенная выше команда преобразует все совпадающие слова из нижнего регистра в верхний. На самом деле этот пример не так полезен, потому что B<greple> может сделать то же самое более эффективно с помощью опции B<--cm>.\n",
   "Also, B<teip> cannot handle multiple lines of data as a single unit, while B<greple> can execute individual commands on a data chunk consisting of multiple lines.\n" : "Кроме того, B<teip> не может обрабатывать несколько строк данных как единое целое, в то время как B<greple> может выполнять отдельные команды на куске данных, состоящем из нескольких строк.\n",
   "App::Greple::tee - module to replace matched text by the external command result\n" : "App::Greple::tee - модуль для замены совпадающего текста на результат внешней команды\n",
   "Because B<greple> is designed to process document files, it has many features that are appropriate for it, such as match area controls. It might be worth using B<greple> to take advantage of those features.\n" : "Поскольку B<greple> предназначен для обработки файлов документов, он имеет много функций, которые подходят для этого, например, управление областью соответствия. Возможно, стоит использовать B<greple>, чтобы воспользоваться этими возможностями.\n",
   "By default, the command is executed as a single process, and all matched data is sent to it mixed together. If the matched text does not end with newline, it is added before and removed after. Data are mapped line by line, so the number of lines of input and output data must be identical.\n" : "По умолчанию команда выполняется как один процесс, и все совпавшие данные передаются ему вперемешку. Если совпадающий текст не заканчивается новой строкой, она добавляется до и удаляется после. Данные сопоставляются построчно, поэтому количество строк входных и выходных данных должно быть одинаковым.\n",
   "Combine a sequence of non-blank lines into a single line before passing them to the filter command. Newline characters between wide characters are deleted, and other newline characters are replaced with spaces.\n" : "Объедините последовательность непустых строк в одну строку перед передачей их команде фильтра. Символы новой строки между широкими символами удаляются, а другие символы новой строки заменяются пробелами.\n",
   "Consider a situation where you want to grep for strings from non-header lines. For example, you may want to search for images from the C<docker image ls> command, but leave the header line. You can do it by following command.\n" : "Рассмотрим ситуацию, когда вы хотите искать строки в строках, не относящихся к заголовкам. Например, вы можете захотеть найти изображения из команды C<docker image ls>, но оставить строку заголовка. Это можно сделать с помощью следующей команды.\n",
   "Filter command follows module declaration (C<-Mtee>) and terminates by two dashes (C<-->). For example, next command call command C<tr> command with C<a-z A-Z> arguments for the matched word in the data.\n" : "Команда фильтрации следует за объявлением модуля (C<-Mtee>) и заканчивается двумя тире (C<-->). Например, следующая команда вызывает команду C<tr> с аргументами C<a-z A-Z> для найденного слова в данных.\n",
   "First of all, whenever you can do it with the B<teip> command, use it. It is an excellent tool and much faster than B<greple>.\n" : "Прежде всего, всегда, когда вы можете сделать это с помощью команды B<teip>, используйте ее. Это отличный инструмент и намного быстрее, чем B<greple>.\n",
   "Greple's B<-Mtee> module sends matched text part to the given filter command, and replace them by the command result. The idea is derived from the command called B<teip>. It is like bypassing partial data to the external filter command.\n" : "Модуль Greple's B<-Mtee> посылает совпавшие части текста заданной команде фильтра и заменяет их результатом команды. Идея взята из команды B<teip>. Это подобно обходу частичных данных внешней командой фильтрации.\n",
   "In this case, C<teip -l 2- -- grep> produces error because the number of lines in the output is less than input. However, result is quite satisfactory :)\n" : "В данном случае команда C<teip -l 2- -- grep> выдает ошибку, так как количество строк на выходе меньше, чем на входе. Однако результат вполне удовлетворительный :)\n",
   "Invoke new command individually for every matched part.\n" : "Вызвать новую команду индивидуально для каждой сопоставленной детали.\n",
   "L<App::Greple::tee>, L<https://github.com/kaz-utashiro/App-Greple-tee>\n" : "L<App::Greple::tee>, L<https://github.com/kaz-utashiro/App-Greple-tee>\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>\n",
   "L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n" : "L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n",
   "L<https://github.com/greymd/teip>\n" : "L<https://github.com/greymd/teip>\n",
   "L<https://github.com/tecolicom/Greple>\n" : "L<https://github.com/tecolicom/Greple>\n",
   "Lines of input and output data do not have to be identical when used with B<--discrete> option.\n" : "Строки входных и выходных данных не должны быть одинаковыми при использовании опции B<--discrete>.\n",
   "Next command will find some indented part in LICENSE document.\n" : "Следующая команда обнаружит в документе LICENSE часть с отступами.\n",
   "Next command will find text blocks inside L<perlpod(1)> style document included in Perl module file.\n" : "Следующая команда найдет текстовые блоки внутри документа стиля L<perlpod(1)>, включенного в файл модуля Perl.\n",
   "Option C<-Mline -L 2:> retrieves the second to last lines and sends them to the C<grep perl> command. Option C<--discrete> is required, but this is called only once, so there is no performance drawback.\n" : "Опция C<-Mline -L 2:> извлекает предпоследние строки и отправляет их команде C<grep perl>. Опция C<--discrete> необходима, но она вызывается только один раз, поэтому недостатка в производительности нет.\n",
   "The C<--fillup> option may not work correctly for Korean text.\n" : "Опция C<--fillup> может работать некорректно для корейского текста.\n",
   "The dedicated module L<App::Greple::xlate::deepl> is more effective for this purpose, though. In fact, the implementation hint of B<tee> module came from B<xlate> module.\n" : "Однако для этой цели более эффективен специализированный модуль L<App::Greple::xlate::deepl>. Фактически, подсказка для реализации модуля B<tee> пришла из модуля B<xlate>.\n",
   "Then convert CR char to NL after by L<tr(1)> command or some.\n" : "Затем преобразуйте символ CR в NL с помощью команды L<tr(1)> или другой.\n",
   "Using B<--discrete> option, individual command is called for each matched part. You can tell the difference by following commands.\n" : "При использовании опции B<--discrete> для каждой сопоставленной детали вызывается отдельная команда. Разницу можно определить по следующим командам.\n",
   "Using C<--discrete> option is time consuming. So you can use C<--separate '\\r'> option with C<ansifold> which produce single line using CR character instead of NL.\n" : "Использование опции C<--discrete> отнимает много времени. Поэтому вы можете использовать опцию C<--separate '\\r'> вместе с C<ansifold>, которая создает одну строку, используя символ CR вместо NL.\n",
   "You can reformat this part by using B<tee> module with B<ansifold> command:\n" : "Вы можете переформатировать эту часть, используя модуль B<tee> с командой B<ansifold>:\n",
   "You can translate them by DeepL service by executing the above command convined with B<-Mtee> module which calls B<deepl> command like this:\n" : "Вы можете перевести их с помощью сервиса DeepL, выполнив приведенную выше команду, соединенную с модулем B<-Mtee>, который вызывает команду B<deepl> следующим образом:\n"
}
