{
   "Above command convert all matched words from lower-case to upper-case. Actually this example itself is not so useful because B<greple> can do the same thing more effectively with B<--cm> option.\n" : "Наведена вище команда перетворює всі знайдені слова з малих літер у великі. Насправді цей приклад не дуже корисний, оскільки B<greple> може зробити те саме ефективніше за допомогою опції B<--cm>.\n",
   "Also, B<teip> cannot handle multiple lines of data as a single unit, while B<greple> can execute individual commands on a data chunk consisting of multiple lines.\n" : "Крім того, B<teip> не може обробляти декілька рядків даних як єдине ціле, тоді як B<greple> може виконувати окремі команди над фрагментом даних, що складається з декількох рядків.\n",
   "App::Greple::tee - module to replace matched text by the external command result\n" : "App::Greple::tee - модуль для заміни знайденого тексту на результат зовнішньої команди\n",
   "Because B<greple> is designed to process document files, it has many features that are appropriate for it, such as match area controls. It might be worth using B<greple> to take advantage of those features.\n" : "Оскільки B<greple> призначено для обробки файлів документів, вона має багато можливостей, які підходять для неї, наприклад, елементи керування областями збігів. Можливо, варто скористатися перевагами B<greple>, щоб скористатися цими можливостями.\n",
   "But with the B<--blocks> option, it can be done as simply as follows:\n" : "Але з опцією B<--blocks> це можна зробити так само просто:\n",
   "By default, the command is executed as a single process, and all matched data is sent to the process mixed together. If the matched text does not end with newline, it is added before sending and removed after receiving. Input and output data are mapped line by line, so the number of lines of input and output must be identical.\n" : "За замовчуванням команда виконується як окремий процес, і всі знайдені дані надсилаються до процесу вперемішку. Якщо знайдений текст не закінчується новим рядком, він додається перед надсиланням і видаляється після отримання. Вхідні та вихідні дані зіставляються рядок за рядком, тому кількість рядків вхідних та вихідних даних має бути однаковою.\n",
   "Combine a sequence of non-blank lines into a single line before passing them to the filter command. Newline characters between wide width characters are deleted, and other newline characters are replaced with spaces.\n" : "Об'єднайте послідовність непорожніх рядків в один рядок, перш ніж передавати їх команді фільтрації. Символи переведення рядка між символами великої ширини буде вилучено, а інші символи переведення рядка буде замінено на пробіли.\n",
   "Combines two or more consecutive newline characters into one.\n" : "Об'єднує два або більше символів нового рядка, що йдуть підряд, в один.\n",
   "Consider a situation where you want to grep for strings from non-header lines. For example, you may want to search for Docker image names from the C<docker image ls> command, but leave the header line. You can do it by following command.\n" : "Розглянемо ситуацію, у якій вам потрібно шукати рядки з рядків, що не є заголовками. Наприклад, ви можете шукати назви образів Docker за допомогою команди C<docker image ls>, але залишити заголовний рядок. Це можна зробити за допомогою наступної команди.\n",
   "Do not use the B<--blocks> with the B<--all> option, since the block will be the entire data.\n" : "Не використовуйте B<--blocks> з опцією B<--all>, оскільки блоком будуть всі дані.\n",
   "Filter command follows module declaration (C<-Mtee>) and terminates by two dashes (C<-->). For example, next command call command C<tr> command with C<a-z A-Z> arguments for the matched word in the data.\n" : "Команда фільтрації слідує за оголошенням модуля (C<-Mtee>) і завершується двома тире (C<-->). Наприклад, наступна команда викликає команду C<tr> з аргументами C<a-z A-Z> для знайденого слова у даних.\n",
   "First of all, whenever you can do it with the B<teip> command, use it. It is an excellent tool and much faster than B<greple>.\n" : "Перш за все, якщо ви можете зробити це за допомогою команди B<teip>, використовуйте її. Вона є чудовим інструментом і працює набагато швидше, ніж B<greple>.\n",
   "For example, to send lines containing the pattern C<foo> to the external command, you need to specify the pattern which matches to entire line:\n" : "Наприклад, щоб надіслати зовнішній команді рядки, що містять шаблон C<foo>, потрібно вказати шаблон, який збігається з усім рядком:\n",
   "Greple's B<-Mtee> module sends matched text part to the given filter command, and replace them by the command result. The idea is derived from the command called B<teip>. It is like bypassing partial data to the external filter command.\n" : "Модуль B<-Mtee> у Greple надсилає частину тексту, що відповідає заданій команді фільтрації, і замінює її на результат команди. Ідея походить від команди з назвою B<teip>. Це схоже на пересилання частини даних до зовнішньої команди фільтрації.\n",
   "If you try to do the same thing with the B<teip> command, C<teip -l 2- -- grep> will give an error because the number of output lines is less than the number of input lines. However, there is no problem with the result obtained.\n" : "Якщо ви спробуєте зробити те саме за допомогою команди B<teip>, C<teip -l 2- -- grep> видасть помилку, оскільки кількість рядків виводу менша за кількість рядків вводу. Втім, з отриманим результатом немає жодних проблем.\n",
   "Invoke new command individually for every matched part.\n" : "Викликати нову команду окремо для кожної знайденої частини.\n",
   "L<App::Greple::tee>, L<https://github.com/kaz-utashiro/App-Greple-tee>\n" : "L<App::Greple::tee>, L<https://github.com/kaz-utashiro/App-Greple-tee>\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>.\n",
   "L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n" : "L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n",
   "L<https://github.com/greymd/teip>\n" : "L<https://github.com/greymd/teip>\n",
   "L<https://github.com/tecolicom/Greple>\n" : "L<https://github.com/tecolicom/Greple>\n",
   "Lines of input and output data do not have to be identical when used with B<--discrete> option.\n" : "При використанні опції B<--discrete> рядки вхідних і вихідних даних не обов'язково повинні бути однаковими.\n",
   "Next command will find some indented part in LICENSE document.\n" : "Наступна команда знайде у документі LICENSE частину з відступами.\n",
   "Next command will find text blocks inside L<perlpod(1)> style document included in Perl module file.\n" : "Наступна команда знайде текстові блоки у документі стилю L<perlpod(1)>, включеному до файлу модуля Perl.\n",
   "Normally, the area matching the specified search pattern is sent to the external command. If this option is specified, not the matched area but the entire block containing it will be processed.\n" : "Зазвичай зовнішній команді надсилається область, що відповідає заданому шаблону пошуку. Якщо вказати цю опцію, то буде оброблено не область, а весь блок, що її містить.\n",
   "Option C<-Mline -L 2:> retrieves the second to last lines and sends them to the C<grep perl> command. The option --discrete is required because the number of lines of input and output changes, but since the command is only executed once, there is no performance drawback.\n" : "Параметр C<-Mline -L 2:> витягує передостанні рядки і надсилає їх команді C<grep perl>. Опція --discrete необхідна, оскільки змінюється кількість рядків вводу і виводу, але оскільки команда виконується лише один раз, це не впливає на продуктивність.\n",
   "The --discrete option will start multiple processes, so the process will take longer to execute. So you can use C<--separate '\\r'> option with C<ansifold> which produce single line using CR character instead of NL.\n" : "Параметр --discrete запускає декілька процесів, тому процес виконуватиметься довше. Тому ви можете скористатися опцією C<--separate '\\r'> з C<ansifold>, яка створить один рядок з використанням символу CR замість NL.\n",
   "The C<--fillup> option will remove spaces between Hangul characters when concatenating Korean text.\n" : "Опція C<--fillup> видалить пробіли між символами ханґульської абетки при конкатенації корейського тексту.\n",
   "The dedicated module L<App::Greple::xlate::deepl> is more effective for this purpose, though. In fact, the implementation hint of B<tee> module came from B<xlate> module.\n" : "Однак для цієї мети ефективніше використовувати спеціальний модуль L<App::Greple::xlate::deepl>. Насправді, підказка щодо реалізації модуля B<tee> прийшла з модуля B<xlate>.\n",
   "Then convert CR char to NL after by L<tr(1)> command or some.\n" : "Потім перетворіть CR символ на NL за допомогою команди L<tr(1)> або іншої.\n",
   "Using B<--discrete> option, individual command is called for each matched text area. You can tell the difference by following commands.\n" : "Використовуючи опцію B<--discrete>, для кожної області тексту, що зіставляється, викликається окрема команда. Ви можете визначити різницю за допомогою наступних команд.\n",
   "With B<--blocks> option, this module behave more like L<teip(1)>'s B<-g> option. Otherwise, the behavior is similar to L<teip(1)> with the B<-o> option.\n" : "З опцією B<--blocks> цей модуль поводитиметься більш подібно до L<teip(1)> з опцією B<-g>. В іншому випадку поведінка подібна до поведінки L<teip(1)> з опцією B<-o>.\n",
   "You can reformat this part by using B<tee> module with B<ansifold> command:\n" : "Ви можете переформатувати цю частину за допомогою модуля B<tee> з командою B<ansifold>:\n",
   "You can translate them by DeepL service by executing the above command convined with B<-Mtee> module which calls B<deepl> command like this:\n" : "Ви можете перекласти їх за допомогою сервісу DeepL, виконавши наведену вище команду, узгоджену з модулем B<-Mtee>, який викликає команду B<deepl> таким чином:\n"
}
