[
   [
      "App::Greple::tee - module to replace matched text by the external command result\n",
      "App::Greple::tee - modul de înlocuire a textului cu rezultatul unei comenzi externe\n"
   ],
   [
      "Greple's B<-Mtee> module sends matched text part to the given filter command, and replace them by the command result. The idea is derived from the command called B<teip>. It is like bypassing partial data to the external filter command.\n",
      "Modulul B<-Mtee> al lui Greple trimite partea de text potrivit la comanda de filtrare dată și le înlocuiește cu rezultatul comenzii. Ideea este derivată din comanda numită B<teip>. Este ca și cum ar ocoli datele parțiale către comanda de filtrare externă.\n"
   ],
   [
      "Filter command follows module declaration (C<-Mtee>) and terminates by two dashes (C<-->). For example, next command call command C<tr> command with C<a-z A-Z> arguments for the matched word in the data.\n",
      "Comanda de filtrare urmează după declarația modulului (C<-Mtee>) și se termină prin două liniuțe (C<-->). De exemplu, următoarea comandă apelează comanda C<tr> comanda cu argumente C<a-z A-Z> pentru cuvântul potrivit din date.\n"
   ],
   [
      "Above command convert all matched words from lower-case to upper-case. Actually this example itself is not so useful because B<greple> can do the same thing more effectively with B<--cm> option.\n",
      "Comanda de mai sus convertește toate cuvintele potrivite din minuscule în majuscule. De fapt, acest exemplu în sine nu este atât de util, deoarece B<greple> poate face același lucru mai eficient cu opțiunea B<--cm>.\n"
   ],
   [
      "By default, the command is executed as a single process, and all matched data is sent to the process mixed together. If the matched text does not end with newline, it is added before sending and removed after receiving. Input and output data are mapped line by line, so the number of lines of input and output must be identical.\n",
      "În mod implicit, comanda este executată ca un singur proces, iar toate datele corespunzătoare sunt trimise la proces amestecate împreună. În cazul în care textul potrivit nu se termină cu newline, acesta este adăugat înainte de trimitere și eliminat după primire. Datele de intrare și de ieșire sunt mapate linie cu linie, astfel încât numărul de linii de intrare și de ieșire trebuie să fie identic.\n"
   ],
   [
      "Using B<--discrete> option, individual command is called for each matched text area. You can tell the difference by following commands.\n",
      "Utilizând opțiunea B<--discret>, comanda individuală este apelată pentru fiecare zonă de text potrivit. Puteți face diferența prin următoarele comenzi.\n"
   ],
   [
      "Lines of input and output data do not have to be identical when used with B<--discrete> option.\n",
      "Liniile de date de intrare și de ieșire nu trebuie să fie identice atunci când se utilizează opțiunea B<--discrete>.\n"
   ],
   [
      "Invoke new command individually for every matched part.\n",
      "Invocarea unei noi comenzi individuale pentru fiecare piesă care se potrivește.\n"
   ],
   [
      "With the <--discrete> option, each command is executed on demand. The\n",
      "Cu opțiunea <--discrete>, fiecare comandă este executată la cerere. Opțiunea\n"
   ],
   [
      "This option replaces all newline characters in the middle of each block with carriage return characters. Carriage returns contained in the result of executing the command are reverted back to the newline character. Thus, blocks consisting of multiple lines can be processed in batches without using the B<--discrete> option.\n",
      "Această opțiune înlocuiește toate caracterele newline din mijlocul fiecărui bloc cu caractere carriage return. Carriage returns conținute în rezultatul executării comenzii sunt returnate la caracterul newline. Astfel, blocurile formate din mai multe linii pot fi procesate în loturi fără a utiliza opțiunea B<--discrete>.\n"
   ],
   [
      "Combine a sequence of non-blank lines into a single line before passing them to the filter command. Newline characters between wide width characters are deleted, and other newline characters are replaced with spaces.\n",
      "Combină o secvență de linii care nu sunt goale într-o singură linie înainte de a le trece la comanda de filtrare. Caracterele newline dintre caracterele de lățime mare sunt șterse, iar celelalte caractere newline sunt înlocuite cu spații.\n"
   ],
   [
      "Combines two or more consecutive newline characters into one.\n",
      "Combină două sau mai multe caractere de linie nouă consecutive într-unul singur.\n"
   ],
   [
      "L<teip(1)>'s B<--offload> option is implemented in the different module B<-Mline>.\n",
      "Opțiunea B<--offload> a L<teip(1)> este implementată în modulul diferit B<-Mline>.\n"
   ],
   [
      "You can also use the B<line> module to process only even-numbered lines as follows.\n",
      "De asemenea, puteți utiliza modulul B<line> pentru a procesa numai liniile cu număr par, după cum urmează.\n"
   ],
   [
      "The B<--blocks> option is no longer needed now that the B<--stretch> (B<-S>) option has been implemented in B<greple>. You can simply perform the following.\n",
      "Opțiunea B<--blocks> nu mai este necesară acum că opțiunea B<--stretch> (B<-S>) a fost implementată în B<greple>. Puteți efectua pur și simplu următoarele.\n"
   ],
   [
      "It is not recommended to use B<--blocks> as it may be deprecated in the future.\n",
      "Nu se recomandă utilizarea opțiunii B<--blocks>, deoarece aceasta poate fi depreciată în viitor.\n"
   ],
   [
      "Normally, the area matching the specified search pattern is sent to the external command. If this option is specified, not the matched area but the entire block containing it will be processed.\n",
      "În mod normal, zona care corespunde modelului de căutare specificat este trimisă la comanda externă. În cazul în care se specifică această opțiune, nu zona care corespunde, ci întregul bloc care o conține va fi procesat.\n"
   ],
   [
      "For example, to send lines containing the pattern C<foo> to the external command, you need to specify the pattern which matches to entire line:\n",
      "De exemplu, pentru a trimite liniile care conțin modelul C<foo> la comanda externă, trebuie să specificați modelul care se potrivește cu întreaga linie:\n"
   ],
   [
      "But with the B<--blocks> option, it can be done as simply as follows:\n",
      "Dar cu opțiunea B<--blocuri>, se poate face la fel de simplu, după cum urmează:\n"
   ],
   [
      "With B<--blocks> option, this module behave more like L<teip(1)>'s B<-g> option. Otherwise, the behavior is similar to L<teip(1)> with the B<-o> option.\n",
      "Cu opțiunea B<--blocuri>, acest modul se comportă mai mult ca opțiunea B<-g> de la L<teip(1)>. În rest, comportamentul este similar cu cel al lui L<teip(1)> cu opțiunea B<-o>.\n"
   ],
   [
      "Do not use the B<--blocks> with the B<--all> option, since the block will be the entire data.\n",
      "Nu utilizați B<--blocks> cu opțiunea B<--all>, deoarece blocul va fi reprezentat de toate datele.\n"
   ],
   [
      "First of all, whenever you can do it with the B<teip> command, use it. It is an excellent tool and much faster than B<greple>.\n",
      "În primul rând, ori de câte ori puteți face acest lucru cu comanda B<teip>, utilizați-o. Este un instrument excelent și mult mai rapid decât B<greple>.\n"
   ],
   [
      "Because B<greple> is designed to process document files, it has many features that are appropriate for it, such as match area controls. It might be worth using B<greple> to take advantage of those features.\n",
      "Deoarece B<greple> este concepută pentru a procesa fișiere document, are multe caracteristici care îi sunt adecvate, cum ar fi controalele zonei de potrivire. Ar putea merita să utilizați B<greple> pentru a profita de aceste caracteristici.\n"
   ],
   [
      "Also, B<teip> cannot handle multiple lines of data as a single unit, while B<greple> can execute individual commands on a data chunk consisting of multiple lines.\n",
      "De asemenea, B<teip> nu poate trata mai multe linii de date ca o singură unitate, în timp ce B<greple> poate executa comenzi individuale pe un fragment de date format din mai multe linii.\n"
   ],
   [
      "Next command will find text blocks inside L<perlpod(1)> style document included in Perl module file.\n",
      "Următoarea comandă va găsi blocuri de text în interiorul documentului de stil L<perlpod(1)> inclus în fișierul modul Perl.\n"
   ],
   [
      "You can translate them by DeepL service by executing the above command convined with B<-Mtee> module which calls B<deepl> command like this:\n",
      "Puteți să le traduceți prin serviciul DeepL executând comanda de mai sus convinsă cu modulul B<-Mtee> care apelează comanda B<deepl> astfel:\n"
   ],
   [
      "The dedicated module L<App::Greple::xlate::deepl> is more effective for this purpose, though. In fact, the implementation hint of B<tee> module came from B<xlate> module.\n",
      "Totuși, modulul dedicat L<App::Greple::xlate::deepl> este mai eficient în acest scop. De fapt, sugestia de implementare a modulului B<tee> a venit de la modulul B<xlate>.\n"
   ],
   [
      "Next command will find some indented part in LICENSE document.\n",
      "Următoarea comandă va găsi o parte indentată în documentul LICENȚĂ.\n"
   ],
   [
      "You can reformat this part by using B<tee> module with B<ansifold> command:\n",
      "Puteți reformata această parte utilizând modulul B<tee> cu comanda B<ansifold>:\n"
   ],
   [
      "The --discrete option will start multiple processes, so the process will take longer to execute. So you can use C<--separate '\\r'> option with C<ansifold> which produce single line using CR character instead of NL.\n",
      "Opțiunea --discrete va porni mai multe procese, astfel încât procesul va dura mai mult timp pentru a se executa. Astfel, puteți utiliza opțiunea C<--separate '\\r'> cu C<ansifold> care produce o singură linie folosind caracterul CR în loc de NL.\n"
   ],
   [
      "Then convert CR char to NL after by L<tr(1)> command or some.\n",
      "Apoi, convertiți caracterul CR în NL prin comanda L<tr(1)> sau alta.\n"
   ],
   [
      "Consider a situation where you want to grep for strings from non-header lines. For example, you may want to search for Docker image names from the C<docker image ls> command, but leave the header line. You can do it by following command.\n",
      "Luați în considerare o situație în care doriți să căutați prin grep șiruri de caractere din liniile fără antet. De exemplu, este posibil să doriți să căutați numele imaginilor Docker din comanda C<docker image ls>, dar să lăsați linia de antet. Puteți face acest lucru prin următoarea comandă.\n"
   ],
   [
      "Option C<-Mline -L 2:> retrieves the second to last lines and sends them to the C<grep perl> command. The option --discrete is required because the number of lines of input and output changes, but since the command is only executed once, there is no performance drawback.\n",
      "Opțiunea C<-Mline -L 2:> recuperează penultima linie și o trimite la comanda C<grep perl>. Opțiunea --discrete este necesară deoarece numărul de linii de intrare și de ieșire se modifică, dar, deoarece comanda este executată o singură dată, nu există niciun dezavantaj de performanță.\n"
   ],
   [
      "If you try to do the same thing with the B<teip> command, C<teip -l 2- -- grep> will give an error because the number of output lines is less than the number of input lines. However, there is no problem with the result obtained.\n",
      "Dacă încercați să faceți același lucru cu comanda B<teip>, C<teip -l 2- -- grep> va da o eroare deoarece numărul de linii de ieșire este mai mic decât numărul de linii de intrare. Cu toate acestea, nu există nicio problemă cu rezultatul obținut.\n"
   ],
   [
      "The C<--fillup> option will remove spaces between Hangul characters when concatenating Korean text.\n",
      "Opțiunea C<--fillup> va elimina spațiile dintre caracterele Hangul la concatenarea textului coreean.\n"
   ]
]
